---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePressureDropData.Roughness
source: html/6fb184df-ae12-8be3-997f-2f9135fa3a07.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.Roughness Property

The roughness of the pipe. Units: (ft).

## Syntax (C#)
```csharp
public double Roughness { get; }
```